Intelligent_Data_Design/Assignments/lec26/lec26.tex
% Created 2023-04-13 Thu 13:54
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{article}
\usepackage[margin=0.5in]{geometry}
\usepackage{syntax}
\usepackage{pdfpages}
\usepackage{tcolorbox}
\usepackage{etoolbox}
\usepackage{environ}
\AtBeginEnvironment{quote}{\itshape}
\usepackage[ruled]{algorithm2e}
\let\oldtabular\tabular
\let\oldendtabular\endtabular
\NewEnviron{tabular2}[1]{\tcbox[left=0mm, right=0mm, top=0mm, bottom=0mm]{\oldtabular{#1}\BODY\oldendtabular}}
\BeforeBeginEnvironment{minted}{\begin{tcolorbox}}%
\AfterEndEnvironment{minted}{\end{tcolorbox}}
\BeforeBeginEnvironment{verbatim}{\begin{tcolorbox}}%
\AfterEndEnvironment{verbatim}{\end{tcolorbox}}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{physics}
\author{David Lewis}
\date{}
\title{lecture 26}
\hypersetup{
 pdfauthor={David Lewis},
 pdftitle={lecture 26},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.0.50 (Org mode 9.6.1)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{1.}
\label{sec:org1cf6e9d}
\begin{itemize}
\item QR factorization
\item D = QR
\item \(Rw = Q^TY\)
\item normalize, then orthogonalize
\item \(u_1 = d_1, q_1 = \frac{u_1}{\|u_1\|}\)
\item \(u_2 = d_2 - (d_2 \cdot q_1)q_1, q_2 = \frac{u_2}{\|u_2\|}\)
\item etc
\end{itemize}
\section*{2.}
\label{sec:org91e72d1}
\begin{minted}[fontsize=\scriptsize]{python}
import numpy as np
import scipy as s
D = np.array([[1, 2, 1],
              [2, 2, 1],
              [3, 4, 1],
              [1, 4, 1]])
Y = [5.1, 6.3, 10.8, 8.8]

Q = []

cols =  whnp.shape(D)[1]
for i in range(cols):
    d = D[:, i]
    u = d
    for i in range(i):
        u = u - np.dot(d,Q[i]) * Q[i]
    Q.append(u/np.linalg.norm(u))

Q,R= np.linalg.qr(D)
W = s.linalg.solve_triangular(R, np.matmul(Q.transpose(), Y))
w = W[:-1]
b = W[-1]
f"w={w}, b={b}"
\end{minted}

\begin{minted}[fontsize=\scriptsize]{python}
def SSE(D):
    yhat = np.sum(D * W, axis=1)
    return sum((Y - yhat)**2)
SSE(D)
\end{minted}

\begin{verbatim}
0.016000000000000028
\end{verbatim}
\section*{3.}
\label{sec:orga5e826e}
\begin{itemize}
\item \(h_\theta(x) = \frac{1}{1+ e^{-\hat \theta^Tx}}\)
\item \(\hat \theta\) is the vector of parameters
\item we update each element in \(\hat \theta\) with:
\(\theta_j \leftarrow \theta_j - \alpha\frac{1}{m} \sum\limits^m_{i=1}(h_{\theta}(x^i) - y^i)x_i\)
\item itereate until convergence
\end{itemize}
\section*{4.}
\label{sec:org6700a32}
steps to perform normalized cut spectral clustering:

\begin{itemize}
\item compute affinity matrix
\item Compute Degree matrix
\begin{itemize}
\item diagonal matrix
\item each entry is the sum of weights of all edges incident with node
\end{itemize}
\item Compute L
\begin{itemize}
\item L = D - W
\item L\textsuperscript{a} = D\textsuperscript{-1} L
\item D\textsuperscript{-.5} L D\textsuperscript{-.5}
\end{itemize}
\item compute k(number of clusters) smallest eigenvalues/eigenvectors of L
\item compute matrix Y from eigenvalue matrix U using \(y_i =
  \frac{1}{\sqrt{\sum^k_{j=1}u^2_{n-j+1, i}}}(\vec{u_i}^T)\)
\item find clusters using k-means on Y
\end{itemize}
\end{document}